Returns whether Revit should wait and try again to acquire the lock on central.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
bool ShouldWaitForLockAvailability()
  Visual Basic
Function ShouldWaitForLockAvailability As Boolean
  Visual C++
bool ShouldWaitForLockAvailability()
 Return Value
 True means wait and try again later. False means immediately give up.
 See Also
  ICentralLockedCallback Interface
  Autodesk.Revit.DB Namespace